multiSpeciesMassTransportLibrary/testCase/diffusionCorrectedReactingFoam_diffusion/constant/reactions
species
(
    H2O
    N2
);

reactions
{
}
